In [2]:
import random
import pandas as pd
import math
path = '/Users/senya/Downloads/'

In [22]:
data = pd.read_csv('data_students.csv', index_col=1)
del data['Unnamed: 6']
data.head()

        Year      Name Club Maths English
Number
1       2013  2013_001    A    76      73
2       2013  2013_002    R    52      88
3       2013  2013_003    A    65      92
4       2013  2013_004    R    58      94
5       2013  2013_005    A    65      83

In [37]:
data[pd.isnull(data.Maths) | pd.isnull(data.English)]

Empty DataFrame
Columns: [Year, Name, Club, Maths, English]
Index: []

## Randomly select 30 students from all the results

In [27]:
randomlist1 = []
for i in range(1, 31):
    n = random.randint(1,545)
    randomlist1.append(n)
print(randomlist1)

[364, 428, 307, 322, 434, 9, 450, 277, 544, 496, 453, 222, 238, 250, 25, 337, 68, 285, 49, 164, 447, 409, 325, 409, 83, 108, 32, 118, 108, 229]

In [28]:
len(randomlist1)

30

In [35]:
data_generated_1 = data.iloc[randomlist1]

In [36]:
# data_generated_1.to_csv(path+'data_gerated_1.csv')

## Randomly select 30 students from the 2017 cohort

In [43]:
data_2017 = data.loc[data.Year == 2017]

In [45]:
len(data_2017)

141

In [49]:
randomlist2 = []
for i in range(1, 31):
    n = random.randint(1,142)
    randomlist2.append(n)
print(randomlist2)

[80, 79, 71, 7, 10, 97, 79, 58, 104, 63, 102, 82, 24, 1, 34, 35, 115, 139, 133, 76, 134, 2, 108, 62, 100, 82, 27, 44, 71, 76]

141

In [50]:
data_generated_2017 = data_2017.iloc[randomlist2]

In [51]:
# data_generated_2017.to_csv(path+'data_generated_2017.csv')

## Randomly select 15 Robotics Club members and 15 Astronomy Club members from all of the results

In [53]:
data_r = data.loc[data.Club == 'R']
data_r

        Year      Name Club Maths English
Number
2       2013  2013_002    R    52      88
4       2013  2013_004    R    58      94
6       2013  2013_006    R    65      85
7       2013  2013_007    R    96      84
8       2013  2013_008    R    89      86
...      ...       ...  ...   ...     ...
537     2017  2017_133    R    78      81
541     2017  2017_137    R    77      46
542     2017  2017_138    R    68      93
544     2017  2017_140    R    77      86
545     2017  2017_141    R    82      93

[269 rows x 5 columns]

In [54]:
data_a = data.loc[data.Club == 'A']
data_a

        Year      Name Club Maths English
Number
1       2013  2013_001    A    76      73
3       2013  2013_003    A    65      92
5       2013  2013_005    A    65      83
9       2013  2013_009    A    87      86
13      2013  2013_013    A    76      92
...      ...       ...  ...   ...     ...
532     2017  2017_128    A    81      74
538     2017  2017_134    A    82      83
539     2017  2017_135    A   100      83
540     2017  2017_136    A    76      82
543     2017  2017_139    A    83      82

[276 rows x 5 columns]

In [55]:
randomlist3 = []
for i in range(1, 15):
    n = random.randint(1, len(data_r)+1)
    randomlist3.append(n)
    
for i in range(15, 31):
    n = random.randint(1, len(data_)+1)
    randomlist3.append(n)
    
print(randomlist3)
len(randomlist3)

[175, 240, 131, 106, 123, 212, 89, 170, 210, 72, 37, 88, 91, 95, 189, 6, 101, 222, 204, 263, 238, 222, 167, 111, 9, 236, 60, 42, 24, 15]

30

In [56]:
data_generated_r_a = data.iloc[randomlist3]

In [58]:
data_generated_r_a.head()

        Year      Name Club Maths English
Number
176     2015  2015_003    A    75      86
241     2015  2015_068    A    83      80
132     2014  2014_063    A    74      76
107     2014  2014_038    R    64      82
124     2014  2014_055    R    49      90

In [59]:
# data_generated_r_a.to_csv(path+'data_generated_r_a.csv')

## Use stratified sampling to randomly select students from each year according to the numbers in that year

In [29]:
randomlist4 = []

for year in set(data['Year']):
    all_rows_with_year = data.loc[data.Year == year]
    stratified_n_years = round(len(all_rows_with_year) / len(data) * 30)
    
    #first entry with the specified year 
    min_ = all_rows_with_year.index[0]
    
    #lst entry with the specified year 
    max_ = all_rows_with_year.index[-1]

    for i in range(stratified_n_years):

        n = random.randint(min_, max_+1)
        randomlist4.append(n)

In [30]:
len(randomlist4)

30

In [31]:
data_stratified = data.iloc[randomlist4]

In [32]:
data_stratified.to_csv(path+'data_stratified.csv')

## Randomly choose a student and then choose every 18th student from there (upon reaching the end of the data, return to the beginning)

In [81]:
randomlist5 = []
for i in range(10, len(data), 18):
    randomlist5.append(i)

In [82]:
data_generated_5 = data.iloc[randomlist5]

In [83]:
# data_generated_5.to_csv(path+'data_generated_5.csv')